Revit 2024 API
RectangleLightShape Constructor (Double, Double)
 Creates a rectangle light shape object with the given emit length and width.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RectangleLightShape(
	double emitLength,
	double emitWidth
)
Visual Basic
Public Sub New ( _
	emitLength As Double, _
	emitWidth As Double _
)
Visual C++
public:
RectangleLightShape(
	double emitLength,
	double emitWidth
)
Parameters
emitLength
Type: System.Double
 The emit length as a numerical value in feet between 1.0e-9 and 30000.0
emitWidth
Type: System.Double
 The emit width as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
RectangleLightShape Class
RectangleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace